// Напиши скрипт подсчета суммы покупки со скидкой в зависимости
// от потраченной суммы за все время(партнерская программа);

// Общая сумма потраченного хранится в переменной totalSpent
// Cумма текущего платежа хранится в переменной Payment
// Скидка хранится в переменной discount.

// [1, 5) - означает от 1 до 4. 5 не включается 

    // Если потрачено от [100 до 1000)- бронзовый партнер скидка 2%.
// Если потрачено от [1000 до 5000) - серебрянный партнер, скидка 5%.
// Если потрачено больше[5000 - золотой партнер, скидка 10%.
// Если потрачено менее 100)- не партнер, скидка 0%.

// В результате вывести сообщение"Оформление заказа на {сумма} со скидкой {скидка}.





















































// const totalSpent = 50;
// let payment = 500;
// let discount = 0;
// let totalSpent = 2000;
// let payment = 500;
// let discount = 0;


//  if (totalSpent >= 100 && totalSpent <= 1000){
//     console.log('бронзовый партнер скидка 2%.');
//     discount = 0.02;
// } else if(totalSpent >= 1000 && totalSpent <= 5000){
//    console.log('серебрянный партнер, скидка 5%.'); 
//    discount = 0.05;
// } else if(totalSpent >= 5000) {
// console.log('золотой партнер, скидка 10%.');
// discount = 0.1;
// } else{
//     console.log('не партнер, скидка 0%');
    
// }
// payment -=  payment * discount;
   

// console.log(`Оформление заказа на ${payment} со скидкой ${discount * 100}%.`);

// totalSpent += payment;
// console.log(`Общая сумма потраченного в магазине ${totalSpent}.`);

